National_bank_xml/MT910encrypted_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getMt910RequestMt102 xmlns:ns2="http://strukturaRtgsNaloga.xml.com" xmlns:ns3="http://mt102.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>eN0Dd8DuaVfZLNNHtXD3BpGGz7MB79yaj7tEgPTm1yBnE4my5PYIPzIWLMMq6yul3clNEV+f7hjy&#13;
eQtKPVrs9fr/K78AUsYfwrz8plWul2cKxSlDTj26xA/j1bbQ97nyH033zcWU5i/FZ1bDoNb9u2TQ&#13;
FdvsAW+tKNDtnoXoRODXlPwu8AbKW6YlRuaVfiw5AyIpJqk50jz2mMAb4X08htY/2pSkYEqZTjoE&#13;
8FSDpLYdNeRWe1xM/elRaUjE5pSQYwSUf0/2Dl5/S2IBrdMSt/FtiUBTwUbForPAxKPoeTRi43Av&#13;
4ml3yEj6b5qgzX28dv69um0+TWZpyzXClLTvfA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>jGn8qgpbdnUOSj/Jnn5Nx28cNiN2L+oRCNU+eYXe4RCHzCepQIpKPCBrRvesA0i66p6F9PM3yvuS&#13;
oppaY1ScfkLxj1sHzLGDaCsjGsHBecZRGDqzCtC9dZvLrF4rcBbClf8PkD/LTjkhFAnWELqYLB32&#13;
Jlkie+COooPYIEArW/rKfkx03qTm2OJJc0RrI0PdAY0o+n2m0vFC0LA2ijyOTh3u9kq0xmxiRMk3&#13;
ut7ApNJxWiuS2mTRwTj3Ay26GKpKSX1UqTW1QRu+IurfFvzBDTOx69T/AbtoPZpqmUc33cnQCvOW&#13;
bOnqBBcE0Mfzd5eCiA+bvfEZVPz2jqaTOXJzlGJsenen+w8bJRggx7tBVYcljhG7f//pxGdyCqle&#13;
shQ99GiDxP8fykwq8FM6YGUTnM9Vu9iiErMoljp7d/1q+jK2ruDRwegl2TWk1ukbe6LdDo3HUYLf&#13;
e0h5vvQ8wMqV0oPT3/HubN62eu9Ub8V/0KNFtEfP96J3HC8qXQ+ORYX/KFkAbtKyEdnkyuIHDsXY&#13;
HYNYCVrQx0sEeFVm6RL2oQBLBdc7pg2u/lv6EhVtToEEMbsZY+tCFINU0AxGPU1Q5k8c2fD3utPy&#13;
K6gUiHVaCexGAO00qkhcncGAeqMTfwFtFaTuYV1B7ysKOjetFEDkWd8Hx1lEXXJQt6FrjfMbrmwz&#13;
C+s3UgscqeBn4g1KadWMO50tb1ll13BhwOWzIc3N6hBo3Mt7RyvQVobhPiq71CraGdkSgUN8z683&#13;
n1h8Wb72jXc03CHyMZ6XKc3T+Fk/kOVEjfiMMStbEUn188+EhjNgHwXlo79KRQu/Zx/asK2KfCDm&#13;
C7y1Ew+2bjyPi5b2B/bi40kwG1uLho+EVqlVECwB9YpsiNWvkfT7jCXir2m5CSwsPNdLa2BgDf/H&#13;
ttuQCpITMAt931lx88I7CfQOriYHADdbKLiFssBM5rM7I/auO+zcieKFMyYRSbUWHdcoXx/OGNUI&#13;
r0bKjuPvrzm8vaBMq3TPHT2BO7ShAQiiJFQ5GunDs2mXSegymB0gbA+c+QDNLgODRt00gW3ZQOjX&#13;
vERiau6jwgxYx1o7R9W+XRrqL5UG75jvi/EqBfkqWSD8iqrfmGbvA4XzQOWNYYeIlaeIOPmW71qN&#13;
eVnE35LQ/nuXQrd6uSRTS2wZhoNXr4gDiIDTzAlgJcyRLqJn27wTT+zeiEC5xc5VlXTIstY5zMIW&#13;
41rndnXfaYS8ar4b/MaMm6QBTmyIuN5NAWJQa12bXEHvdC7Uv+uzeSLj/3R/l96MiRvX96hqV9kG&#13;
qCBO70TfAP9VW48brahUa4rgK9jWLMydEqfBdoIIlvpCmIR7MqnwQt4YqSP54F+aecJdYInWPSIH&#13;
IEUkcdQGCbPfHZotnZjC/16vNcPGLq1pBcuGbQGSnXmDRS3Az1vq4XFW0p2wytN2Ps5eshIkKJt8&#13;
g+ga+mfdYlqkExRUhk0kuR94JH7/EJJDKz13dhjJnzhg+9noxRw36Ee3p6HSeql9hsxF+EjGk8td&#13;
uZX4KZTdqhiBZoxAaMPIy+Kg9EqAgUsm7svOHl3g7QBDy7qdEHniCffUE9yv4NefIlNmZsYEn6X3&#13;
WJvd2UcP+EmvEjUb8U1voWHmCQydwSATaJThiEGDjcgoZwHIw0hD1cPBqpV/uWpGg2C7dmp80Acy&#13;
C6SkhBaXhqHgWxQ/PGNlYILCyjFPxuCrjMTUCzfYxIwOLgv3yCoyb5w4JOZy68mPYYmK/joWAEjs&#13;
w22XBKf9/BYtb724eQ6M8QBy4xGGC9kG+sE2kMhmosG+bmo7gpr60i353Fwl7yNy3xM6P/0tcPZu&#13;
IurLzytLaCuiC1g3vesy5QtwjL1SzxMrt5NyxXoiEWHEVsl2/OnEZjvBR6ggnnrskpu0KetSC0Fw&#13;
uQOoZ+w5pYJEi/NDw0cNJvuaFWBEnHTRkZIu9sHVEoP8RXRBT7S8lXvBRMBSIuuGmFWXeQBl5zH6&#13;
yGcbLVaVi8XZOQ5GMElL/UVOCUkh7wk+kaxsXTVjf2oRF5n0JmjYSv81BsaMq7IP2yzIpGi0HkdR&#13;
twOQI6zKakbtwJ8U0Gp/8flWlQKyVD1I2dsIDeo=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getMt910RequestMt102></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>xXMNARwHivw7jZsSnV7PpI+11GU=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
GuQyFNFhU3oNOdLNTBhzmgbuyM5HnF6XQ72qWMsKqt5/L8JhVmACMuj3tQZdP9hvWMT0byeubrtL&#13;
+hlqbnARrhfVQa0BY9jSFC1sjixKQ6IiV9ZzFpIiFOcFrTYyvVbuc9RZsJjeMglsrSlCfUE9ndfY&#13;
xsz4KQdIWcrpDA354quFQ2I/QPNTs8icSzuNIsTWmqWIpH6ZQXFCqmceIJ4ymu4SBpTkhgkYScAp&#13;
Zmv4V+F40JPtL3Us47vUN9gIqDyXdW/WuraBwp4QfcnMWx+JPXJlJMJDckJaFjjNzcOPvom7hurB&#13;
KATNzyY8lZ+lVkYavt7izfY4IMmRkwc5Zc/H0w==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iB4brM9IcSzO94vsP2oklqN2bnPRIj4WnkokiLR4pwUiZPDwNOmz8VXfq73I6HA1++WGYMTxBwwi&#13;
YTWlCvBBGoN/iKQNY31bk/8ybvHCH+jfLuMe6LGkOzqiXKOARR+13D4/55JmhGIry6ZaUHNnBEQw&#13;
oO9I30t90tLf+t2+AJUes1cRv8bbXtkoiykA4ZGdT+xaB8t41LIdNIRFNYaupGQPs3td7xZn7kJd&#13;
nEv2KIma8gOlDDkr8M2TARRmbcLSsr4MPXosIalThZE8Nt5l/zRQiRM9pSW2zAVAqQ/frLf8ZZuS&#13;
TQwy1wt+OJ4DX+DVcya9ONNRNXvfCMGyxdheyw==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDyDCCArCgAwIBAgIEWUhQjjANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjCBlDEWMBQGA1UE&#13;
AwwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2Ru&#13;
YSBiYW5rYTEMMAoGA1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEa&#13;
MBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0MzgwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB&#13;
AQCIHhusz0hxLM73i+w/aiSWo3Zuc9EiPhaeSiSItHinBSJk8PA06bPxVd+rvcjocDX75YZgxPEH&#13;
DCJhNaUK8EEag3+IpA1jfVuT/zJu8cIf6N8u4x7osaQ7OqJco4BFH7XcPj/nkmaEYivLplpQc2cE&#13;
RDCg70jfS33S0t/63b4AlR6zVxG/xtte2SiLKQDhkZ1P7FoHy3jUsh00hEU1hq6kZA+ze13vFmfu&#13;
Ql2cS/YoiZryA6UMOSvwzZMBFGZtwtKyvgw9eiwhqVOFkTw23mX/NFCJEz2lJbbMBUCpD9+st/xl&#13;
m5JNDDLXC344ngNf4NVzJr0401E1e98IwbLF2F7LAgMBAAGjIDAeMA8GA1UdEwEB/wQFMAMBAf8w&#13;
CwYDVR0PBAQDAgH2MA0GCSqGSIb3DQEBCwUAA4IBAQBKgkCxBNwHmG/wEYU8Od6HkxihXWPj1h12&#13;
fG+q61jmb4fYSRfJ0izYvn5nrXht+WQh/TSDoR5b/FyKbjwyTqT14F+SduxLVKQ2SEdeO/nvHE3r&#13;
nQBV4fRejhZU5tfX6L5axwh33CP+S1BJ/hVzF5q2gctUkL4lCcfvcjk+ybKoi0+d4xuavtHrdfc8&#13;
B3R5xQoJHpWijNLg0JQn76/9gt1GMvBduxBUB1RE32w0+mWlCI1aQEOcM69rXRgRW6BWWP1GyMGr&#13;
YeOsFn5vAOQWf2es2a7JbPdCz78z61ULiljUXSYC60ihwwBCoC0ehlp1itw6xPMtT2xlzvAZ2a+l&#13;
miTA
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>